Управление ИТ фирмой/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Управление ИТ фирмой/InformationRegisters/Скидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Скидки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураНоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Управление ИТ фирмой/CommonModules/ЦеныСервер/Ext/Module.bsl
// Функция - Цена на дату
// Находит и возвращает актуальную стоимость номенклатуры на указанный момент времени.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Элемент, для которого запрашивается цена.
//  Дата - Дата	- Момент времени для среза последних (если не указана, берется текущая).
// 
// Возвращаемое значение:
// Число (ОпределяемыйТип.Сумма)  - Актуальная цена товара или 0, если цена не установлена.
//
Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) ИЛИ НачалоДня(Дата) = Дата Тогда
		ЦелеваяДата = ТекущаяДата(); 
	Иначе
		ЦелеваяДата = Дата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ЦелеваяДата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Цена;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;  
	
КонецФункции

// Функция - Скидка на дату
// Находит актуальный процент скидки с приоритетом: конкретный товар -> номенклатурная группа товара.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Товар, для которого ищется скидка.
//  Дата - Дата - Момент времени для среза последних.
// 
// Возвращаемое значение:
//  Число - Процент скидки или 0, если скидка не найдена.
//
Функция СкидкаНаДату(Номенклатура, Дата) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) ИЛИ НачалоДня(Дата) = Дата Тогда
		ЦелеваяДата = ТекущаяДата(); 
	Иначе
		ЦелеваяДата = Дата;
	КонецЕсли;
	
	НоменклатурнаяГруппаТовара = Номенклатура.НоменклатурнаяГруппа;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа КАК ОбъектСкидки,
		|	СкидкиСрезПоследних.Скидка КАК Скидка
		|ИЗ
		|	РегистрСведений.Скидки.СрезПоследних(&Период, НоменклатураНоменклатурнаяГруппа В (&СписокОтбора)) КАК СкидкиСрезПоследних";
	
	СписокОтбора = Новый Массив;
	СписокОтбора.Добавить(Номенклатура);
	Если ЗначениеЗаполнено(НоменклатурнаяГруппаТовара) Тогда
		СписокОтбора.Добавить(НоменклатурнаяГруппаТовара);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", ЦелеваяДата);
	Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	СкидкаПоНоменклатуре = 0;
	СкидкаПоГруппе = 0;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОбъектСкидки = Номенклатура Тогда
			СкидкаПоНоменклатуре = Выборка.Скидка;
		ИначеЕсли Выборка.ОбъектСкидки = НоменклатурнаяГруппаТовара Тогда
			СкидкаПоГруппе = Выборка.Скидка;
		КонецЕсли;
	КонецЦикла;
	
	Если СкидкаПоНоменклатуре <> 0 Тогда
		Возврат СкидкаПоНоменклатуре;
	Иначе
		Возврат СкидкаПоГруппе;
	КонецЕсли;
	
КонецФункции
